html/go/go-patterns/visitor.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>访问者</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="pipeline.html"> UP </a>
 |
 <a accesskey="H" href="go-patterns.html"> HOME </a>
</div><div id="content">
<h1 class="title">访问者</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb7460fe">简单示例</a></li>
<li><a href="#org8d38423">k8s相关背景</a>
<ul>
<li><a href="#org4bfb401">kubectl的实现方法</a>
<ul>
<li><a href="#org9e20663">Visitor模式定义</a></li>
<li><a href="#orgf8f4d9b">实现Visitor</a>
<ul>
<li><a href="#orgd0ab982">Name Visitor</a></li>
<li><a href="#org37a909b">Other Visitor</a></li>
<li><a href="#org5a24738">Log Visitor</a></li>
</ul>
</li>
<li><a href="#org95a0041">调用Vistor的代码</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Visitor 是面向对象设计模英中一个很重要的设计模款，这个模式是一种将 <span class="underline">算法</span> 与 <span class="underline">操作对象的结构</span> 分离的一种方法。这种分离的实际结果是能够 <b>在不修改结构的情况下向现有对象结构添加新操作</b> ，是遵循 <span class="underline">开放/封闭</span> 原则的一种方法
</p>

<pre class="example">
这篇文章重点看一下 kubelet 中是怎么使用函数式的方法来实现这个模式的
</pre>
<div id="outline-container-orgb7460fe" class="outline-2">
<h2 id="orgb7460fe">简单示例</h2>
<div class="outline-text-2" id="text-orgb7460fe">
<p>
先来看一个简单设计模式的Visitor的示例：
</p>
<ul class="org-ul">
<li>有一个 <span class="underline">Visitor的函数</span> 定义，还有一个 <span class="underline">Shape接口</span> ，其需要使用 Visitor函数做为参数</li>
<li>实例对象 <span class="underline">Circle</span> 和 <span class="underline">Rectangle</span> 实现了 Shape 的接口的 <span class="underline">accept()</span> 方法，这个方法就是等外面给它传递一个Visitor</li>
</ul>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #00bfff; font-weight: bold;">package</span> main

<span style="color: #00bfff; font-weight: bold;">import</span> (
        <span style="color: #deb887;">"encoding/json"</span>
        <span style="color: #deb887;">"encoding/xml"</span>
        <span style="color: #deb887;">"fmt"</span>
)

<span style="color: #00bfff; font-weight: bold;">type</span> <span style="color: #98f5ff;">Visitor</span> <span style="color: #00bfff; font-weight: bold;">func</span>(<span style="color: #4eee94;">shape</span> <span style="color: #98f5ff;">Shape</span>)

<span style="color: #00bfff; font-weight: bold;">type</span> <span style="color: #98f5ff;">Shape</span> <span style="color: #00bfff; font-weight: bold;">interface</span> {
        <span style="color: #daa520; font-weight: bold;">accept</span>(<span style="color: #98f5ff;">Visitor</span>)
}

<span style="color: #00bfff; font-weight: bold;">type</span> <span style="color: #98f5ff;">Circle</span> <span style="color: #00bfff; font-weight: bold;">struct</span> {
        Radius <span style="color: #98f5ff;">int</span>
}

<span style="color: #00bfff; font-weight: bold;">func</span> (<span style="color: #4eee94;">c</span> <span style="color: #98f5ff;">Circle</span>) <span style="color: #daa520; font-weight: bold;">accept</span>(<span style="color: #4eee94;">v</span> <span style="color: #98f5ff;">Visitor</span>) {
        <span style="color: #daa520; font-weight: bold;">v</span>(c)
}

<span style="color: #00bfff; font-weight: bold;">type</span> <span style="color: #98f5ff;">Rectangle</span> <span style="color: #00bfff; font-weight: bold;">struct</span> {
        Width, Heigh <span style="color: #98f5ff;">int</span>
}

<span style="color: #00bfff; font-weight: bold;">func</span> (<span style="color: #4eee94;">r</span> <span style="color: #98f5ff;">Rectangle</span>) <span style="color: #daa520; font-weight: bold;">accept</span>(<span style="color: #4eee94;">v</span> <span style="color: #98f5ff;">Visitor</span>) {
        <span style="color: #daa520; font-weight: bold;">v</span>(r)
}
</pre>
</div>

<p>
接下来实现两个Visitor，一个是用来做JSON序列化的，另一个是用来做XML序列化的：
</p>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">JsonVisitor</span>(<span style="color: #4eee94;">shape</span> <span style="color: #98f5ff;">Shape</span>) {
        <span style="color: #4eee94;">bytes</span>, <span style="color: #4eee94;">err</span> := json.<span style="color: #daa520; font-weight: bold;">Marshal</span>(shape)
        <span style="color: #00bfff; font-weight: bold;">if</span> err != <span style="color: #ffd700;">nil</span> {
                <span style="color: #f08080;">panic</span>(err)
        }
        fmt.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #daa520; font-weight: bold;">string</span>(bytes))
}

<span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">XmlVisitor</span>(<span style="color: #4eee94;">shape</span> <span style="color: #98f5ff;">Shape</span>) {
        <span style="color: #4eee94;">bytes</span>, <span style="color: #4eee94;">err</span> := xml.<span style="color: #daa520; font-weight: bold;">Marshal</span>(shape)
        <span style="color: #00bfff; font-weight: bold;">if</span> err != <span style="color: #ffd700;">nil</span> {
                <span style="color: #f08080;">panic</span>(err)
        }
        fmt.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #daa520; font-weight: bold;">string</span>(bytes))
}
</pre>
</div>

<p>
使用Visitor这个模式的代码：
</p>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
        <span style="color: #4eee94;">c</span> := <span style="color: #98f5ff;">Circle</span>{10}
        <span style="color: #4eee94;">r</span> :=  <span style="color: #98f5ff;">Rectangle</span>{100, 200}
        <span style="color: #4eee94;">shapes</span> := []<span style="color: #98f5ff;">Shape</span>{c, r}

        <span style="color: #00bfff; font-weight: bold;">for</span> <span style="color: #4eee94;">_</span>, <span style="color: #4eee94;">s</span> := <span style="color: #00bfff; font-weight: bold;">range</span> shapes {
                s.<span style="color: #daa520; font-weight: bold;">accept</span>(JsonVisitor)
                s.<span style="color: #daa520; font-weight: bold;">accept</span>(XmlVisitor)
        }

}
</pre>
</div>

<p>
其实，这段代码的目的就是想解耦 <span class="underline">数据结构</span> 和 <span class="underline">算法</span> 
</p>

<pre class="example">
使用 Strategy 模式也是可以完成的，而且会比较干净
</pre>

<p>
但是有些情况下，多个Visitor是来访问 <b>同一个数据结构的不同部分</b> 
</p>

<pre class="example">
这种情况下，数据结构有点像一个数据库，而各个Visitor会成为一个个小应用

kubectl就是这种情况
</pre>
</div>
</div>
<div id="outline-container-org8d38423" class="outline-2">
<h2 id="org8d38423">k8s相关背景</h2>
<div class="outline-text-2" id="text-org8d38423">
<p>
来了解一下相关的知识背景：
</p>
<ul class="org-ul">
<li>对于Kubernetes，其抽象了很多种的Resource，比如：Pod, ReplicaSet, ConfigMap, Volumes, Namespace, Roles …
<ul class="org-ul">
<li>种类非常繁多，这些东西构成为了Kubernetes的数据模型</li>
</ul></li>
<li>kubectl 是Kubernetes中的一个客户端命令，操作人员用这个命令来操作Kubernetes
<ul class="org-ul">
<li>kubectl 会联系到 Kubernetes 的API Server，API Server会联系每个节点上的 kubelet ，从而达到控制每个结点</li>
<li>kubectl 主要的工作是处理用户提交的东西（包括，命令行参数，yaml文件等），然后其会把用户提交的这些东西组织成一个数据结构体，然后把其发送给 API Server。</li>
</ul></li>
</ul>


<pre class="example">
kubectl 的代码比较复杂，不过，其本原理简单来说：

它从命令行和yaml文件中获取信息，通过Builder模式并把其转成一系列的资源

最后用 Visitor 模式模式来迭代处理这些Reources
</pre>

<p>
下面来看看 kubectl 的实现，为了简化，用一个小的示例来表明 ，而不是直接分析复杂的源码
</p>
</div>
<div id="outline-container-org4bfb401" class="outline-3">
<h3 id="org4bfb401">kubectl的实现方法</h3>
<div class="outline-text-3" id="text-org4bfb401">
</div>
<div id="outline-container-org9e20663" class="outline-4">
<h4 id="org9e20663">Visitor模式定义</h4>
<div class="outline-text-4" id="text-org9e20663">
<p>
首先，kubectl 主要是用来处理 <span class="underline">Info结构体</span> ，下面是相关的定义：
</p>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #00bfff; font-weight: bold;">type</span> <span style="color: #98f5ff;">VisitorFunc</span> <span style="color: #00bfff; font-weight: bold;">func</span>(*<span style="color: #98f5ff;">Info</span>, <span style="color: #98f5ff;">error</span>) <span style="color: #98f5ff;">error</span>

<span style="color: #00bfff; font-weight: bold;">type</span> <span style="color: #98f5ff;">Visitor</span> <span style="color: #00bfff; font-weight: bold;">interface</span> {
        <span style="color: #daa520; font-weight: bold;">Visit</span>(<span style="color: #98f5ff;">VisitorFunc</span>) <span style="color: #98f5ff;">error</span>
}

<span style="color: #00bfff; font-weight: bold;">type</span> <span style="color: #98f5ff;">Info</span> <span style="color: #00bfff; font-weight: bold;">struct</span> {
        Namespace   <span style="color: #98f5ff;">string</span>
        Name        <span style="color: #98f5ff;">string</span>
        OtherThings <span style="color: #98f5ff;">string</span>
}

<span style="color: #00bfff; font-weight: bold;">func</span> (<span style="color: #4eee94;">info</span> *<span style="color: #98f5ff;">Info</span>) <span style="color: #daa520; font-weight: bold;">Visit</span>(<span style="color: #4eee94;">fn</span> <span style="color: #98f5ff;">VisitorFunc</span>) <span style="color: #98f5ff;">error</span> {
        <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #daa520; font-weight: bold;">fn</span>(info, <span style="color: #ffd700;">nil</span>)
}
</pre>
</div>

<ul class="org-ul">
<li>一个 <span class="underline">VisitorFunc</span> 的 <b>函数类型</b> 的定义</li>
<li>一个 <span class="underline">Visitor 的接口</span> ，其中需要 <span class="underline">Visit(VisitorFunc) error  的方法</span></li>
<li>为 <span class="underline">Info</span> 实现 <span class="underline">Visitor 接口</span> 中的 <span class="underline">Visit() 方法</span> ，实现就是 <b>直接调用传进来的方法</b></li>
</ul>

<p>
再来定义几种不同类型的 Visitor 
</p>
</div>
</div>
<div id="outline-container-orgf8f4d9b" class="outline-4">
<h4 id="orgf8f4d9b">实现Visitor</h4>
<div class="outline-text-4" id="text-orgf8f4d9b">
</div>
<div id="outline-container-orgd0ab982" class="outline-5">
<h5 id="orgd0ab982">Name Visitor</h5>
<div class="outline-text-5" id="text-orgd0ab982">
<p>
主要是用来 <b>访问</b> Info 结构中的 <span class="underline">Name</span> 和 <span class="underline">NameSpace</span> 成员：
</p>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #00bfff; font-weight: bold;">type</span> <span style="color: #98f5ff;">NameVisitor</span> <span style="color: #00bfff; font-weight: bold;">struct</span> {
        visitor <span style="color: #98f5ff;">Visitor</span>
}

<span style="color: #00bfff; font-weight: bold;">func</span> (<span style="color: #4eee94;">v</span> <span style="color: #98f5ff;">NameVisitor</span>) <span style="color: #daa520; font-weight: bold;">Visit</span>(<span style="color: #4eee94;">fn</span> <span style="color: #98f5ff;">VisitorFunc</span>) <span style="color: #98f5ff;">error</span> {
        <span style="color: #00bfff; font-weight: bold;">return</span> v.visitor.<span style="color: #daa520; font-weight: bold;">Visit</span>(<span style="color: #00bfff; font-weight: bold;">func</span>(<span style="color: #4eee94;">info</span> *<span style="color: #98f5ff;">Info</span>, <span style="color: #4eee94;">err</span> <span style="color: #98f5ff;">error</span>) <span style="color: #98f5ff;">error</span> {
                fmt.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #deb887;">"NameVisitor() before call function"</span>)
                err = <span style="color: #daa520; font-weight: bold;">fn</span>(info, err)
                <span style="color: #00bfff; font-weight: bold;">if</span> err == <span style="color: #ffd700;">nil</span> {
                        fmt.<span style="color: #daa520; font-weight: bold;">Printf</span>(<span style="color: #deb887;">"==&gt; Name=%s, NameSpace=%s\n"</span>, info.Name, info.Namespace)
                }
                fmt.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #deb887;">"NameVisitor() after call function"</span>)
                <span style="color: #00bfff; font-weight: bold;">return</span> err
        })
}
</pre>
</div>

<ul class="org-ul">
<li>声明了一个 <span class="underline">NameVisitor 的结构体</span> ，这个结构体里有一个 <span class="underline">Visitor 接口成员</span> ，这里意味着 <b>多态</b></li>
<li>实现 Visit() 方法时，其调用了自己结构体内的那个 Visitor的 Visitor() 方法
<ul class="org-ul">
<li>这其实是一种修饰器的模式，用另一个Visitor修饰了自己</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org37a909b" class="outline-5">
<h5 id="org37a909b">Other Visitor</h5>
<div class="outline-text-5" id="text-org37a909b">
<p>
这个Visitor主要用来访问 Info 结构中的 <span class="underline">OtherThings 成员</span> ：
</p>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #00bfff; font-weight: bold;">type</span> <span style="color: #98f5ff;">OtherThingsVisitor</span> <span style="color: #00bfff; font-weight: bold;">struct</span> {
        visitor <span style="color: #98f5ff;">Visitor</span>
}

<span style="color: #00bfff; font-weight: bold;">func</span> (<span style="color: #4eee94;">v</span> <span style="color: #98f5ff;">OtherThingsVisitor</span>) <span style="color: #daa520; font-weight: bold;">Visit</span>(<span style="color: #4eee94;">fn</span> <span style="color: #98f5ff;">VisitorFunc</span>) <span style="color: #98f5ff;">error</span> {
        <span style="color: #00bfff; font-weight: bold;">return</span> v.visitor.<span style="color: #daa520; font-weight: bold;">Visit</span>(<span style="color: #00bfff; font-weight: bold;">func</span>(<span style="color: #4eee94;">info</span> *<span style="color: #98f5ff;">Info</span>, <span style="color: #4eee94;">err</span> <span style="color: #98f5ff;">error</span>) <span style="color: #98f5ff;">error</span> {
                fmt.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #deb887;">"OtherThingsVisitor() before call function"</span>)
                err = <span style="color: #daa520; font-weight: bold;">fn</span>(info, err)
                <span style="color: #00bfff; font-weight: bold;">if</span> err == <span style="color: #ffd700;">nil</span> {
                        fmt.<span style="color: #daa520; font-weight: bold;">Printf</span>(<span style="color: #deb887;">"==&gt; OtherThings=%s\n"</span>, info.OtherThings)
                }
                fmt.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #deb887;">"OtherThingsVisitor() after call function"</span>)
                <span style="color: #00bfff; font-weight: bold;">return</span> err
        })
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5a24738" class="outline-5">
<h5 id="org5a24738">Log Visitor</h5>
<div class="outline-text-5" id="text-org5a24738">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00bfff; font-weight: bold;">type</span> <span style="color: #98f5ff;">LogVisitor</span> <span style="color: #00bfff; font-weight: bold;">struct</span> {
        visitor <span style="color: #98f5ff;">Visitor</span>
}

<span style="color: #00bfff; font-weight: bold;">func</span> (<span style="color: #4eee94;">v</span> <span style="color: #98f5ff;">LogVisitor</span>) <span style="color: #daa520; font-weight: bold;">Visit</span>(<span style="color: #4eee94;">fn</span> <span style="color: #98f5ff;">VisitorFunc</span>) <span style="color: #98f5ff;">error</span> {
        <span style="color: #00bfff; font-weight: bold;">return</span> v.visitor.<span style="color: #daa520; font-weight: bold;">Visit</span>(<span style="color: #00bfff; font-weight: bold;">func</span>(<span style="color: #4eee94;">info</span> *<span style="color: #98f5ff;">Info</span>, <span style="color: #4eee94;">err</span> <span style="color: #98f5ff;">error</span>) <span style="color: #98f5ff;">error</span> {
                fmt.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #deb887;">"LogVisitor() before call function"</span>)
                err = <span style="color: #daa520; font-weight: bold;">fn</span>(info, err)
                fmt.<span style="color: #daa520; font-weight: bold;">Println</span>(<span style="color: #deb887;">"LogVisitor() after call function"</span>)
                <span style="color: #00bfff; font-weight: bold;">return</span> err
        })
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org95a0041" class="outline-4">
<h4 id="org95a0041">调用Vistor的代码</h4>
<div class="outline-text-4" id="text-org95a0041">
<p>
如果使用上面的代码：
</p>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #00bfff; font-weight: bold;">func</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
        <span style="color: #4eee94;">info</span> := <span style="color: #98f5ff;">Info</span>{}
        <span style="color: #00bfff; font-weight: bold;">var</span> <span style="color: #4eee94;">v</span> <span style="color: #98f5ff;">Visitor</span> = &amp;info
        v = <span style="color: #98f5ff;">LogVisitor</span>{v}
        v = <span style="color: #98f5ff;">NameVisitor</span>{v}
        v = <span style="color: #98f5ff;">OtherThingsVisitor</span>{v}

        <span style="color: #4eee94;">loadFile</span> := <span style="color: #00bfff; font-weight: bold;">func</span>(<span style="color: #4eee94;">info</span> *<span style="color: #98f5ff;">Info</span>, <span style="color: #4eee94;">err</span> <span style="color: #98f5ff;">error</span>) <span style="color: #98f5ff;">error</span> {
                info.Name = <span style="color: #deb887;">"Hao Chen"</span>
                info.Namespace = <span style="color: #deb887;">"MegaEase"</span>
                info.OtherThings = <span style="color: #deb887;">"We are running as remote team."</span>
                <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #ffd700;">nil</span>
        }
        v.<span style="color: #daa520; font-weight: bold;">Visit</span>(loadFile)
}
</pre>
</div>

<pre class="example">
可以看到：
1. Visitor们一层套一层
2. 用 loadFile 假装从文件中读如数据
3. v.Visit(loadfile) 上面的代码就全部开始激活工作了 
</pre>

<p>
上面的代码输出如下的信息
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #daa520; font-weight: bold;">LogVisitor</span>() before call <span style="color: #00bfff; font-weight: bold;">function</span>
<span style="color: #daa520; font-weight: bold;">NameVisitor</span>() before call <span style="color: #00bfff; font-weight: bold;">function</span>
<span style="color: #daa520; font-weight: bold;">OtherThingsVisitor</span>() before call <span style="color: #00bfff; font-weight: bold;">function</span>
==&gt; <span style="color: #4eee94;">OtherThings</span>=We are running as remote team.
<span style="color: #daa520; font-weight: bold;">OtherThingsVisitor</span>() after call <span style="color: #00bfff; font-weight: bold;">function</span>
==&gt; <span style="color: #4eee94;">Name</span>=Hao Chen, <span style="color: #4eee94;">NameSpace</span>=MegaEase
<span style="color: #daa520; font-weight: bold;">NameVisitor</span>() after call <span style="color: #00bfff; font-weight: bold;">function</span>
<span style="color: #daa520; font-weight: bold;">LogVisitor</span>() after call <span style="color: #00bfff; font-weight: bold;">function</span>
</pre>
</div>

<pre class="example">
请思考下代码的执行顺序是怎么样的
</pre>

<p>
上面的代码有以下几种功效：
</p>
<ul class="org-ul">
<li>解耦了数据和程序</li>
<li>使用了修饰器模式</li>
<li>做出来pipeline的模式</li>
</ul>

<p>
<a href="pipeline.html">Previous：管道</a>
</p>

<p>
<a href="go-patterns.html">Home：目录</a>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
